Revit 2026 API

# MassSurfaceDataCategoryIdForConceptualSurfaceType Property

---

Returns the mass subcategory ElementId used for ConceptualSurfaceType for this MassSurfaceData.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId CategoryIdForConceptualSurfaceType { get; }
```
```vb
Public ReadOnly Property CategoryIdForConceptualSurfaceType As ElementId
	Get
```
```cpp
public:
property ElementId^ CategoryIdForConceptualSurfaceType {
	ElementId^ get ();
}
```
```fsharp
member CategoryIdForConceptualSurfaceType : ElementId with get
```

#### Property Value

ElementId

This value is determined by starting with the subcategory property and adjusting it according to properties such as "isSlab" or "isUnderground".

#### Reference

MassSurfaceData Class

Autodesk.Revit.DB.Analysis Namespace